src/src/Catalogs/CashAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>CashAccounts</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CurrencyByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccountByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessCalendar</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Calendars</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileFacsimilePrinting</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntityIndividual</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CounterpartyType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LogoFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CompaniesAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCashByDefault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RegistrationCountry</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Countries</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VATNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalForm</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalForms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ContactInformation</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Type</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Kind</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactInformationTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValues</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Country</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Region</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>City</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmailAddress</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ServerDomainName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumberWithoutCodes</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ActivityTypes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ActivityType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ActivityTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Catalogs/CashAccounts/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Gets the default petty cash for the company, or the only petty cash if the default petty cash is not specified.
//
Function GetPettyCashByDefault(Company = Undefined) Export

	PettyCashByDefault = Catalogs.CashAccounts.EmptyRef();
	
	If PettyCashByDefault.IsEmpty() AND Company <> Undefined Then
		
		Query = New Query;
		Query.Text = 
		"SELECT ALLOWED
		|	CashAccounts.Ref AS PettyCashByDefault
		|FROM
		|	Catalog.Companies AS Companies
		|		INNER JOIN Catalog.CashAccounts AS CashAccounts
		|		ON Companies.PettyCashByDefault = CashAccounts.Ref
		|WHERE
		|	Companies.Ref = &Ref";
		
		Query.SetParameter("Ref", Company);
		Selection = Query.Execute().Select();
		If Selection.Next() Then
			PettyCashByDefault = Selection.PettyCashByDefault;
		EndIf;
		
	EndIf;
	
	If PettyCashByDefault.IsEmpty() Then
		
		Query = New Query;
		Query.Text = 
		"SELECT ALLOWED TOP 2
		|	CashAccounts.Ref AS PettyCashByDefault
		|FROM
		|	Catalog.CashAccounts AS CashAccounts
		|WHERE
		|	NOT CashAccounts.DeletionMark";
		
		Selection = Query.Execute().Select();
		If Selection.Count() = 1 И Selection.Next() Then
			PettyCashByDefault = Selection.PettyCashByDefault;
		EndIf;
		
	EndIf;
	
	Return PettyCashByDefault;

EndFunction

#Region PrintInterface

// Fills in the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see the fields content in the PrintManagement.CreatePrintCommandsCollection function
//
Procedure AddPrintCommands(PrintCommands) Export
	
	
	
EndProcedure

#EndRegion

#EndIf
